In [3]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [8]:
df = pd.read_csv('insurance - insurance.csv')

In [9]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [11]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

# Encoding

In [14]:
#LabelEncoder

In [14]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [20]:
df.sex = le.fit_transform(df[['sex']])
df.smoker = le.fit_transform(df[['smoker']])

In [22]:
df.head()

   age  sex     bmi  children  smoker     region      charges
0   19    0  27.900         0       1  southwest  16884.92400
1   18    1  33.770         1       0  southeast   1725.55230
2   28    1  33.000         3       0  southeast   4449.46200
3   33    1  22.705         0       0  northwest  21984.47061
4   32    1  28.880         0       0  northwest   3866.85520

In [24]:
#Loop
for col in df.columns:
    if df[col].dtype == np.object:
        dummy = pd.get_dummies(df[col], drop_first=True,prefix='region')
        df.drop(df[[col]], axis=1, inplace=True)
        df = pd.concat([df, dummy], axis=1)

In [25]:
df.head()

,sex,bmi,children,smoker,charges,region_northwest,region_southeast,region_southwest
0,0,27.900,0,1,16884.92400,0,0,1
1,1,33.770,1,0,1725.55230,0,1,0
2,1,33.000,3,0,4449.46200,0,1,0
3,1,22.705,0,0,21984.47061,1,0,0
4,1,28.880,0,0,3866.85520,1,0,0